# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [8]:
#Your code here
import sqlite3
import pandas as pd

connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [10]:
#Your code here
cursor.execute('''SELECT firstName, lastName FROM employees join offices using (officeCode) WHERE city = 'Boston';''')
cursor.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [40]:
#Your code here
cursor.execute('''SELECT city, count(*) FROM offices left join employees using (officeCode) group by 1;''')
df = pd.DataFrame(cursor.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [33]:
# Your code here 
#Display customer and customer number
cursor.execute('''SELECT contactFirstName, contactLastName, customerNumber from customers join orders using (customerNumber);''')
df = pd.DataFrame(cursor.fetchall())
df.head()

         0        1    2
0  Carine   Schmitt  103
1  Carine   Schmitt  103
2  Carine   Schmitt  103
3     Jean     King  112
4     Jean     King  112

In [44]:
# Your code here
#Number of products sold
cursor.execute('''SELECT productName, count(*) from products join orderdetails using (productCode) group by 1;''')
df = pd.DataFrame(cursor.fetchall())
df.head()

                                     0   1
0  18th Century Vintage Horse Carriage  28
1                18th century schooner  27
2               1900s Vintage Bi-Plane  28
3              1900s Vintage Tri-Plane  28
4                    1903 Ford Model A  27

In [61]:
# Your code here

,0,1,2,3,4,5,6,7,8,9,10,11
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_1749,30,136.00,3
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_2248,50,55.09,2
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_4409,22,75.46,4
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S24_3969,49,35.29,1
4,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10101,S18_2325,25,108.06,4

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!